<template>
    <div class="container-lg">
        <div class="row row-cols-3 p-0 m-0 mt-3 blockshow">
            <div class="col-2 logo-left">
                &nbsp;
            </div>
            <div class="col-8">
                <h5 class="text-red text-uppercase p-0 m-1 text-center"></h5>
                <h5 class="text-red text-uppercase p-0 m-0 text-center mt-4 pt-2"><b>O'zbek tili milliy korpusi</b></h5>
                <h5 class="text-red text-uppercase p-0 m-1 text-center"></h5>
            </div>
            <div class="col-2 logo-right">
                &nbsp;
            </div>
        </div>
        <div class="mt-2">
            <nav class="navbar border-style navbar-dark bg-info navbar-expand-lg"><button type="button"
                    aria-label="Toggle navigation" class="navbar-toggler collapsed" aria-expanded="false"
                    aria-controls="nav-text-collapse" style="overflow-anchor: none;"><span
                        class="navbar-toggler-icon"></span></button> <a href="/" class="navbar-brand nuxt-link-active"
                    target="_self">
                    Bosh sahifa
                </a>
                <div id="nav-text-collapse" class="navbar-collapse collapse" style="display: none;">
                    <ul class="navbar-nav">
                        <li class="nav-item b-nav-dropdown dropdown" id="__BVID__17"><a role="button" aria-haspopup="true"
                                aria-expanded="false" href="#" target="_self" class="nav-link dropdown-toggle"
                                id="__BVID__17__BV_toggle_"><span>Loyiha haqida</span></a>
                            <ul tabindex="-1" class="dropdown-menu dropdown-menu-right"
                                aria-labelledby="__BVID__17__BV_toggle_">
                                <div class="card">
                                    <li role="presentation" class="submenyu yangihover1"><a href="/buyurtmachi"
                                            class="dropdown-item" role="menuitem" target="_self">
                                            Buyurtmachi tashkilot
                                        </a></li>
                                    <li role="presentation" class="submenyu yangihover1"><a href="/ijrochi"
                                            class="dropdown-item" role="menuitem" target="_self">
                                            Ijrochi tashkilot
                                        </a></li>
                                    <li role="presentation" class="submenyu yangihover1"><a href="/jamoa"
                                            class="dropdown-item" role="menuitem" target="_self">
                                            Ilmiy jamoa
                                        </a></li>
                                    <li role="presentation" class="submenyu yangihover1"><a href="/nashrlar"
                                            class="dropdown-item" role="menuitem" target="_self">
                                            Nashrlar
                                        </a></li>
                                </div>
                                <div class="card mt-1">
                                    <li role="presentation" class="submenyu yangihover1"><a href="/korpushaqida"
                                            class="dropdown-item" role="menuitem" target="_self">
                                            Korpus haqida
                                        </a></li>
                                    <li role="presentation" class="submenyu yangihover1"><a href="/boshqakorpuslar"
                                            class="dropdown-item" role="menuitem" target="_self">
                                            Boshqa korpuslar
                                        </a></li>
                                </div>
                            </ul>
                        </li>
                        <li class="nav-item"><a href="/lugatlar" aria-current="page"
                                class="nav-link nuxt-link-exact-active nuxt-link-active" target="_self">
                                Lug'at
                            </a></li>
                        <li class="nav-item b-nav-dropdown dropdown" id="__BVID__39"><a role="button" aria-haspopup="true"
                                aria-expanded="false" href="#" target="_self" class="nav-link dropdown-toggle"
                                id="__BVID__39__BV_toggle_"><span>Tilshunoslik tadqiqotlari</span></a>
                            <ul tabindex="-1" class="dropdown-menu dropdown-menu-right"
                                aria-labelledby="__BVID__39__BV_toggle_">
                                <li role="presentation" class="submenyu yangihover1"><a href="/statistiktahlil"
                                        class="dropdown-item" role="menuitem" target="_self">
                                        Statistik tahlil
                                    </a></li>
                                <li role="presentation" class="submenyu yangihover1"><a href="/qidiruv"
                                        class="dropdown-item" role="menuitem" target="_self">
                                        Konkordans
                                    </a></li>
                            </ul>
                        </li>
                        <li class="nav-item"><a href="/yangiliklar" class="nav-link" target="_self">
                                Yangiliklar
                            </a></li>
                        <li class="nav-item"><a href="/boglanish" class="nav-link" target="_self">
                                Bog'lanish
                            </a></li>
                        <li class="nav-item"><a href="#" target="_self" class="nav-link">
                                Matn kiritish
                            </a></li>
                        <li class="nav-item"><a href="#" target="_self" class="nav-link">
                                Akt So'zlar
                        </a></li>
                    </ul>
                </div>
            </nav>
        </div>
        <div class="p-3 background-paper mt-2 vh100">
            <h3 class="text-uppercase text-center text-black-50">
                korpus lug'ati
            </h3>
            <div>
                <form class="form-inline w-100" @submit.prevent="submit">
                    <input v-model="word" type="text"
                        :class="`form-control mb-2 mr-sm-2 inputWidth100 shadow-none ${validation.word ? 'is-invalid' : ''}`"
                        placeholder="So'z kiriting...">
                    <button v-if="loading" type="submit" class="btn btn-success mb-2 buttonWidth" :disabled="loading">
                        <div class="spinner-border spinner-border-sm text-light" role="status">
                            <span class="sr-only">Topilmoqda...</span>
                        </div>
                    </button>
                    <button v-else type="submit" class="btn btn-success mb-2 buttonWidth">
                        Izlash
                    </button>
                </form>
                <small v-if="validation.word" class="text-danger">
                    {{ validation.word }}
                </small>
            </div>
            <div>
                <h3 class="text-warning p-0 m-0 font-weight-bold">
                    <div class="row">
                        <div class="col-md-6">
                            <button class="btn btn-light" @click.prevent="speachVoice">
                                <!-- <img src="../../essets/images/speaker1.png"> -->
                                <img src="/assets/speaker1.png">
                            </button>
                        </div>
                        <div class="col-md-6" />
                    </div>
                </h3>
                <div class="row m-0 p-0 w-100">
                    <div class="col-md-4 border-bottom">
                        <p class="text-black-50 p-0 m-0 font-weight-bold mt-4">
                            Grammatik tavsif:
                        </p>
                    </div>
                    <div class="col-md-8 border-bottom">
                        <p class="text-black-50 p-0 m-0 font-weight-bold mt-4">
                            <span class="blue-text">{{ razmetka }}</span>
                        </p>
                    </div>
                </div>
                <div class="row m-0 p-0">
                    <div class="col-md-4 border-bottom">
                        <p class="text-black-50 p-0 m-0 font-weight-bold mt-4">
                            Lug'aviy shakl:
                        </p>
                    </div>
                    <div class="col-md-8 border-bottom">
                        <p class="text-black-50 p-0 m-0 font-weight-bold mt-4">
                            <span class="blue-text">{{ lemma }}</span>
                        </p>
                    </div>
                </div>
                <div class="row m-0 p-0">
                    <div class="col-md-4 border-bottom">
                        <p class="text-black-50 p-0 m-0 font-weight-bold mt-4">
                            Izoh:
                        </p>
                    </div>
                    <div class="col-md-8 border-bottom">
                        <p class="text-black-50 p-0 m-0 font-weight-bold mt-4">
                            <span class="blue-text izoh" v-html="izoh" />
                        </p>
                    </div>
                </div>
                <!-- <div class="row mt-2">
                    <div class="col-md-12">
                        <div class="mt-5">
                            <div>
                                <button class="btn btn-secondary mb-2">
                                    Imo-ishoralar
                                </button>
                            </div>
                            <div>
                                <span v-for="(figure, index) in figures" :key="index">
                                    <img class="mr-1" :src="`/imo/${figures[index]}.jpg`">
                                </span>
                            </div>
                        </div>
                    </div>
                </div> -->
            </div>
        </div>
        <div class="bg-info mt-2 row qisqa">
            <div class="col-6 card13">
                <p class="p-2 m-0 text-center text-uppercase text-white">
                    O'zbekiston Respublikasi Vazirlar Mahkamasi huzuridagi <br> O'zbek tilini rivojlantirish jamg'armasi
                </p>
            </div>
            <div class="col-6 card13">
                <p class="p-2 m-0 text-center text-uppercase text-white">
                    Muhammad al-Xorazmiy nomidagi <br>Toshkent Axborot Texnologiyalari Universiteti Samarqand filiali
                </p>
            </div>
        </div>
    </div>
</template>
  
<script>
export default {
    data: () => ({
        word: '',
        title: '',
        lemma: '',
        izoh: '',
        razmetka: '',
        validation: {
            word: ''
        },
        loading: false,
        figures: [],
        items: [],
        words: [
            { a: "AAA", b: "Authentication, Authorization and Accounting", c: "Мазкур атама ахборот хавфсизлигида фойдаланишга рухсат бериш ва уни назорат қилиш жараёнини таърифлаш учун ишлатилади." },
            { a: "ABI", b: "Application Binary Interface", c: "Қўлланмаларнинг бинар интерфейси. Операцион тизимнинг ресурсларидан қўлланмаларнинг фойдаланиш усулини аниқлайдиган спецификация. Тўла ўгиришдан ўтказилган қўлланмаларнинг бир хил ABIлик тизимлар орасида кўчувчанлигини таъминлайди." },
            { a: "AC-3", b: "AC-3 формати (шунингдек, Dolby Digital ҳам).", c: "Dolby Laboratories томонидан ишлаб чиқилган рақамли оқим формати. Бешта асосий ва битта паст частотали товуш каналлари ҳақидаги ахборотни ўз ичига олади." },
            { a: "ACE", b: "Access Control Entry", c: "Кира олишни бошқариш ёзуви (рўйхатдан фойдалана олиш нуқтаси). Windows NT ва Windows 2000 хавфсизлик тизимида кира олишни бошқариш (ACL) рўйхатининг элементи." },
            { a: "ACID", b: "Atomicity, Consistency, Isolation, Durability", c: "Атомарлик, зиддиятсизлик, яккаланганлик, мустаҳкамлик. Булар транзакцияга хос хусусиятлардир. Атомарлик (atomicity) хусусияти, транзакцияга кираётган амаллар бўлинмас иш бирлигидек намоён бўлади, яъни барча амаллар ё муваффақиятли якунланади, ё бекор қилинади. Бу тизим зиддиятсизлигини (consistency) кафолатлаш имконини беради: ташқи кузатувчи нуқтаи назаридан тизим, транзакция бошланишидан олдин ҳам, у якунланганидан кейин ҳам зиддиятсизлик ҳолатида бўлади. Яккаланганлик (isolation) хусусияти зиддиятсизликни транзакция давомига ҳам тегишли қилади, яъни бажариш давомида бир транзакция бошқа якунланмагантранзакциялар қилган ўзгаришларни \"кўрмайди\". Мустаҳкамлик (durability) бажариб бўлинган транзакциялар ўзгаришлари, пастки поғоналардаги тўхтаб қолишлардан қатъий назар, хоҳ бехосдан қайта юкланиш бўлсин, хоҳ қурилмаларнинг бузилиши бўлсин, сақланишини билдиради."},
            { a: "ACK", b: "ACKnowledgement", c: "Тасдиқлаш. Маълумотлар муваффақиятли қабул қилинганлигини тасдиқловчи сигнал." },
            { a: "ACL", b: "Access Control List", c: "Фойдаланишнинг назорат рўйҳатлари. Фойдаланишни танланган бошқаришга асосланган тизимларнинг асосини ташқил қилади. Улар муайян объектдан ким ёки нима фойдалана олиши ҳамда ушбу субъект объект билан қандай операцияларни бажара олиши ёки бажара олмаслигини белгилайди. ACLга асосланган хавфсизлик моделига эга тизимда, субъект объект устида операцияни бажаришни сўраганда тизим аввал ушбу субъектга рухсат этилган операциялар рўйхатини текширади ва фақат шундан сўнг сўралган ҳаракатга рухсат беради ёки бермайди." },
            { a: "ACM", b: "Association for Computing Machinery", c: "Ҳисоблаш техникаси бўйича уюшма. Ҳисоблаш техникаси соҳасидаги халқаро уюшма." },
            { a: "ACPI", b: "Advanced Configuration and Power management Interface", c: "ACPI спецификацияси, электр таъминот конфигурацияси ва уни бошқариш учун яхшиланган интерфейс. Операцион тизим билан шахсий компьютер аппарат воситалари электр озуқа конфигурацияси ва уни бошқариш учун ўзаро алоқада ишлашини тавсифловчи очиқ спецификация. Қурилмаларни дастурий равишда, электр озуқани камроқ сарфлаш режимига ва уни тескари олдингисига ўтказиш." },
            { a: "ActiveX", c: "Веб-саҳифалар яратувчиларига интерактив муҳитни яратиш имконини берувчи техника воситалари ва амаллар тўплами, кўп сонли асбобларни яхлит қилиб бирлаштириш воситаси." },
            { a: "ADC", b: "Analog to Digital Converter", c: "Аналог-рақамли ўзгартиргич. Аналог сигнални рақамли кодга ўзгартириш учун мўлжалланган, яъни аналог кириш сигнали кучланишининг ҳар бир қийматига чиқишдаги рақамли коднинг муайян қиймати мос келади. ADC асосан товуш картасида мавжуд бўлиб, ташқи манбадан келаётган товушни қаттиқ дискка ёзиш учун ишлатилади." },
            { a: "ADMA", b: "Advanced DMA (controller)", c: "Такомиллаштирилган DMA контроллери." },
            { a: "ADO", b: "ActiveX Data Objects", c: "ActiveX маълумотларининг объектлари. Microsoft компаниясининг COM-объектлар орқали маълумотлар базаларидан фойдаланиш технологияси." },
            { a: "Adobe Systems", c: "Дастурий таъминот ишлаб чиқаришга ихтисослашган компания. Adobe Systemsнинг энг машҳур маҳсулоти - бу Acrobat кўриш муҳарриридир. Компания столусти нашр тизимлари ва шрифт тўпламларини ишлаб чиқаради. Компания томонидан яратилган график тасвирларга (Photoshop, Illustrator) ва видеофильмларга (Premiere) ишлов бериш амалий дастурлари кенг тарқалган." },
            { a: "ADPCM", b: "Adaptive Differential Pulse Code Modulation", c: "Мослашувчан дифференциал импульс-кодли усул асосида модуллаш. Нутқни зичлаштириб рақамли кодлаш учун ITU стандарти. Ўтказиш қобилияти 32 Кбит/секунд бўлган канал орқали нутқни узатиш имконини беради. Телефонияда ишлатилади." },
            { a: "ADSL", b: "Asymmetric Digital Subscriber Line", c: "Асимметрик рақамли абонент линияси. Маълумотларни телефон линиялари бўйлаб юқори тезлик билан узатиш технологияси. DSL оиласига мансуб технологиялардан бири. Оммавий фойдаланувчиларга мўлжалланган нисбатан арзон технологиядир. Маълумотларни узатиш асимметрик, яъни дастлабки трафикка нисбатан чиқиш трафигига анча каттароқ частота оралиғи ажратилади. 8 Мбит/секунд тезликкача сигналларни қабул қилиб, 1 Мбит/секундгача тезлик билан узатади. ADSL-модемлар орасидаги телефон симларининг узунлиги 7 кмдан ошмаслиги керак. Иш вақтида маълумотларни узатиш тезлиги телефон линиясининг аҳволига (шовқин даражаси, тўсиқлар сони ва ҳ.к.) қараб ўзгариши мумкин. Бундан ташқари, ADSLуланиш шовқинларга, айниқса шу телефон кабелидан ўтказилган бошқа рақамли алоқа линияларидаги шовқинларга сезгирдир." },
            { a: "ADT", b: "Abstract Data Type", c: "Маълумотларнинг мавҳум тури. Муайян амалга оширилмай, уларнинг усулларини ва хоссаларини санаб ўтиш орқали белгиланадиган маълумотлар тури (мавҳум класси)." },
            { a: "AES", b: "1 Advanced Encryption Standard", c: "– Блокли шифрлашнинг симметрик алгоритми (блокнинг катталиги 128 бит, калити 128/192/256 бит), AES танлови натижалари асосида АҚШ ҳукумати томонидан шифрлаш стандарти сифатида қабул қилинган. Мазкур алгоритм яхши таҳлил қилинган ва бугунги кунда ундан олдин ишлатилган DES алгоритми каби кенг қўлланилади. AES симметрик шифрлашнинг энг кенг тарқалган алгоритмларидан биридир. 2 Audio Engineering Society – Аудио инженерларнинг уюшмаси. 3 Application Environment Specification – Амалий дастурлар муҳити спецификацияси. OSF томонидан очиқ тизимларда фойдаланувчи интерфейсни яратиш учун спецификациялар йиғмаси." },
            { a: "AFTN", b: "Aeronautical Fixed Telecommunication Network", b: "Авиация алоқасининг кўчмас тармоғи." },
            { a: "AFTP", b: "Anonymous FTP Аноним FTP-сервер.", c: "Аноним тарзда (Anonymous номи билан) уланишга ижозат берадиган FTP-сервер." },
            { a: "AGC", b: "Automatic Gain Control", c: "Кучайтиришни автоматик ростлаш." },
            { a: "AGP", b: "Accelerated Graphics Port", c: "Тезлаштирилган график порт, AGP-порт. Видеокартани шахсий компьютерга улаш учун интерфейс спецификацияси." },
            { a: "AIM", b: "AOL Instant Messenger", c: "AOL компанияси хизматларидан бири. Оний хабарлар алмашиш дастурининг номи." },
            { a: "AIT", b: "Advanced Intelligent Tape", c: "Тафаккур тасмаси\". Sony фирмаси томонидан ишлаб чиқилган магнит тасмада ёзув қурилмасининг тури." },
            { a: "AIX", b: "Advanced Interactive eXecutive", c: "IBM ривожлантираётган UNIX версияси." },
            { a: "AJAX",  b: "Asynchronous Javascript And XML", c: "Асинхрон JavaScript ва XML. Браузер маълумотларининг веб-сервер билан фонда алмашишини таъминлайдиган вебқўлланмаларнинг интерактив фойдаланувчи интерфейсларини қуриш усули. Натижада маълумотлар янгиланганда веб-саҳифа тўлиқ қайта юкланмайди, веб-қўлланмалар эса тезроқ ва қулайлироқ бўлади." },
            { a: "Alcatel-Lucent", c: "Тармоқлар учун жиҳозлар ишлаб чиқарувчи компания. 2006 йилнинг 1 декабрида иккита компания - Alcatel ва Lucent Technologies бирлашиши натижасида яратилган." },
            { a: "ALGOL", b: "Математик масалаларни ечиш учун мўлжалланган дастурлаш тили. Биринчи навбатда ALGOL (алгоритмик тил) сонли масалаларни ечишга мўлжалланган. Тилнинг синтаксиси аниқ белгиланганлиги ALGOLнинг муайян тур тузилмага эга бўлган компьютерларга нисбатан мустақил бўлишини таъминлади. Тилнинг алоҳида томони бўлиб унинг блокли тузилмасидир. ALGOL кўпроқ Европада тарқалди ва янги тилларнинг, масалан, Pascal тилининг яратилишида муҳим босқич бўлди." },
            { a: "ALU", b: "Arithmetic and Logic Unit", c: "Арифметик-мантиқий қурилма, AMҚ. Процессорнинг арифметик ва мантиқий амалларни бажарадиган қисми." },
            { a: "AM", b: "Amplitude Modulation", c: "Амплитуда модуляцияси." },
            { a: "AMD", c: "Компьютер таркибий қисмларини ишлаб чиқарувчи компания. AMD компанияси АҚШда (Саннивейл ш.) 1969 йилда яратилган. AMD процессорлар, флеш-хотира қурилмалари, дастурлаштирилувчи мантиқий матрицалар, микроконтроллерларни ишлаб чиқаришга ихтисослашган." },
            { a: "AMPS", b: "Advanced Mobile Phone Service", c: "Уяли телефон хизмати учун яхшиланган AMPS стандарти. Аналог уяли телефон алоқасининг дастлабки тизимларидан бири. FDMAни ишлатади. Россияда AMPS-800, 800 МГц частотали оралиқ, АҚШда эса Н-AMPS ишлатилади." },
            { a: "Andrew", c: "Коммуникация тармоқларини яратувчи ва ишлатувчи компания. Andrew компанияси 1937 йили АҚШда яратилган, Европа, Россия, Мексика, Австралияда ваколатхоналарга эга. Andrew коаксиал кабеллар, оптик каналлар, йўлдош тармоғи каналлари, радиоканаллар, ҳудудий ва маҳаллий тармоқларни яратиш учун зарур бўлган аппаратурани таклиф этади." },
            { a: "Android", c: "Google ташаббуси билан бошлаб берилган, Open Handset Alliance (OHA) ишлаб чиқаётган Linuxга асосланган мобил телефонлар учун платформа. У ишлаб чиқилган Google кутубхоналаридан фойдаланиб, бошқарувчи қурилма орқали Java қўлланмаларни яратиш имконини беради." },
            { a: "ANN", c: "Artificial Neural Network Сунъий нейрон тармоғи." },
            { a: "ANSI", b: "American National Standards Institute", c: "Америка миллий стандартлаштириш институти. Стандартлаштириш масалалари бўйича АҚШдаги бош ташкилот." },
            { a: "ANSI", c: "графикаси Рақамли графиканинг ушбу тури тасвирни белгилардан яратади, бироқ у ASCII коди белгилардан ташқари DOS тизимида ишлатилган ANSI.SYS драйвери қўллайдиган 224 та чоп этиш белгиси, шрифтнинг 16 та ранги ва 8 та фон рангидан ҳам фойдаланади. Файллар одатда .ans кенгайтмасига эга бўлган. Уларни яратишда махсус дастурлар, жумладан, Ян Э. Дэвис (Ian E. Davis) томонидан 1986 йилда ёзилган TheDraw пакети ишлатилган. Ушбу пакет, шунингдек, анимацияни яратишга имкон берган ва \"шрифтлар\", яъни кичик белгилардан иборат бўлган катта белгиларга эга бўлган."},
            { a: "AO", b: "Analog Output", c: "Аналог чиқиш." },
            { a: "AOL", b: "America On-Line", c: "АҚШдаги Интернет провайдери." },
            { a: "Apache Software Foundation (ASF)", c: "Apache дастурий таъминот лойиҳаларини ривожлантиришга қаратилган жамғарма. ASF 1999 йили Apache Groupдан ташкил топган. ASF жамғармаси дунёнинг турли мамлакатларида яшовчи ва Open Source лойиҳаларда ишловчи ташаббускор дастурчилардан ташкил топган. Apache лойиҳаларнинг фарқли томони - кодни биргаликда дастурлаш ва очиқ лицензия - Apache Software Licenseдан фойдаланиш." },
            { a: "Apache Software License", c: "Бошқа эркин ДТ лицензияларга ўхшаб, Apache лицензияси фойдаланувчига ДТни исталган мақсадда қўллашга, эркин тарқатишга, ўзгартиришга ҳамда ўзгартирилган нусхаларни тарқатишга имкон беради. Бу лицензия ДТнинг ўзгартирилмасликни тарқатиш шарти сифатида қўймайди. Унинг бепул ва очиқ ҳолатини сақлаб қолишни ҳам талаб қилмайди. Apache нинг биттадан битта шарти бу олувчининг Apache лицензияси остидаги илк кодидан фойдаланилганлигини етказишдир. Шундай қилиб, copyleft лицензияларига, аксинча, ўзгартирилган версия олувчиси албатта Apache лицензия томонидан бериладиган ҳамма ҳуқуқларга эгалигини билдирмайди." },
            { a: "API", b: "Application Programming Interface", c: "Амалий дастурлаш интерфейси. Ўз дастурларининг тегишли операцион тизимлар билан уйғунлашуви учун дастурий таъминот ишлаб чиқувчилар амал қилишлари керак бўлган вазифалар йиғмасининг спецификацияси." },
            { a: "APIDS", c: "Маълум қўлланмалар учун специфик протоколлардан фойдаланган ҳолда узатиладиган маълумотларни назорат ва таҳлил қилувчи тизим. Масалан, SQL маълумотлар базасига эга веб-серверда таҳдидларни аниқлаш тизими серверга узатиладиган SQL буйруқлар таркибини назорат қилади." },
            { a: "APL", b: "A Programming Language", c: "APL дастурлаш тили. XX асрнинг 60- йилларида ишлаб чиқилган." },
            { a: "Apple", c: "Микропроцессор ва шахсий компьютерлар ишлаб чиқарувчи компания. Apple Computer АҚШда 1976 йили Стивен Жобс ва Стивен Возняк томонидан яратилган ва шахсий компьютерларни ишлаб чиқаришнинг асосчиси ва етакчиларидан бири ҳисобланади. Apple Computer, шунингдек, компьютерлар учун кенг кўламдаги амалий тизим ва дастурий таъминот ишлаб чиқаради. Apple компьютерлари катта имкониятлари ва уларга хизмат кўрсатиш осонлиги билан фарқланади. Электрон идоралар ва ўргатувчи тизимларда айниқса машҳур. Appleнинг асосий янги томонлари қуйидагилардан иборат: - илк бор 1983 йили Lisa компьютерида тақдим этилган фойдаланувчининг график интерфейси. - 1977 йилда ишлаб чиқарилган Apple II компьютери биринчи рангли мониторли компьютер бўлган. - ичига ўрнатилган тармоқни қўллаш. 1985 йилда Apple компанияси ичига ўрнатилган тармоқни қўллаш (LocalTalk)га эга Macintosh компьютерининг янги версиясини ишлаб чиқарган. - \"Plug- and - play\" технологияси. - 1991 йилда Apple компанияси QuickTime, видео, аудио ва бошқа мультимедиали қўлланмалар учун кўп платформали стандартни тақдим этган. - 1993 йилда Apple компанияси Macintosh TV, ичига ўрнатилган телевизорга эга биринчи шахсий компьютерни ишлаб чиқарган. - 1994 йилда Apple компанияси RISC микропроцессорига асосланган Power Mac компьютерини тақдим этган. - 1998 йилда Apple ўзининг iMac компьютерини яратди. - 2001 йил 24 март куни Mac OS X тақдим этилди. У NeXTнинг OPENSTEP ва BSD Unixга асосланган бўлиб, уни ишлаб чиқиш учун бир неча йил кетди. - 2001 йилда Apple iPod портатив рақамли аудио плеерни тақдим этди. Маҳсулот жуда машҳур бўлди – олти йил давомида 100 миллиондан кўп iPod сотилди. - 2003 йилда Apple iTunes Storeни тақдим этди. Унда iPodга юклаш учун нархи 99 цент бўлган қўшиқлар сотила бошланди. - 2006 йилда Apple MacBook Pro деб номланган ноутбукни тақдим этди. У Apple Powerbook G4 компьютерларининг ўрнини босиш учун яратилди. Барча моделлар тегишнинг тўртта турини аниқлайдиган Multitouch трекпад ва ёруғлик датчиги билан жиҳозланган клавиатурага эга бўлган. - 2007 йилда Apple тўрт диапазонли GSM телефон iPhoneни тақдим этди. У ўзида iPod, мобил телефон ва интернет-планшет имкониятларини мужассамлаштирган. Қурилма телефонда ишлаш учун оптималлаштирилган Mac OS Xнинг модификацияланган версияси бўлган iPhone OS бошқарувида ишлайди. - 2008 йилда MacBook Air – MacBook сериясидаги ўта портатив ноутбук тақдим этилди. Унинг максимал қалинлиги – 1,93 см, вазни – 1,36 кг. - 2010 йилда iPad планшетни тақдим этди."},
            { a: "ARPA", b: "Advanced Research Projects Agency", c: "Истиқболли тадқиқот лойиҳалари бўйича агентлик. Ҳарбий соҳадаги илмий тадқиқотларни мувофиқлаштирувчи, АҚШ мудофаа вазирлигига бўйсунувчи тузилма. ARPA томонидан TCP/IP протоколлари оиласи ишлаб чиқилган ва ARPAnet тармоғи яратилган." },
            { a: "ARPAnet", b: "Advanced Research Projects Agency NETwork", c: "ARPAnet тармоғи. Пакетларни коммутацияланадиган маълумотлар узатишга оид дастлабки глобал тармоқдан бири. ARPA ташаббуси билан 1968 йили ҳозирги Интернет тармоғининг тажрибавий нусхаси намуна сифатида яратилган." },
            { a: "ASCI", b: "Accelerated Strategic Computing Initiative", c: "Суперкомпьютерли стратегик ташаббус, ASCI дастури. АҚШ энергетика вазирлигининг ерости ядро портлашларини моделлашга қодир суперкомпьютерни яратишга қаратилган узоқ муддатли дастури." },
            { a: "ASCII", b: "American Standard Code for Information Interchange", c: "Ахборот алмашуви учун Америка стандарт коди, ASCII коди"},
            { a: "ASCII-графикаси", b: "Тасвирий санъат шакли, ASCII белгиларини компьютер терминалининг (терминал сервери) эни чекланган экранда ёки принтерда тасвирини намойиш қилиш учун ишлатилади. Бундай тасвирни яратиш учун ҳарф ва рақам белгиларидан ҳамда ASCII жадвалининг 95 белгиларидан олинган пунктуация белгиларидан ташкил топган палитрадан фойданилади. Миллий вариантдаги тизимлар тақдими фарқланиши эҳтимоли катта бўлгани туфайли, жадваллардаги қолган 160 белги кўпинча ишлатилмайди." },
            { a: "ASIC", b: "Application-Specific Integrated Circuit", c: "Ихтисослашган микросхема." },
            { a: "ASN.1", b: "Abstract Syntax Notation One", c: "ASN.1 тили, 1-версия учун мавҳум синтаксис қоидаси. OSIда ишлатиладиган мавҳум синтаксисга асосланган тузилмаларни тавсифлаш тили." },
            { a: "ASPI", b: "Advanced SCSI Programming Interface", c: "SCSI учун дастурлашнинг такомиллаштирилган интерфейси." },
            { a: "ASR", b: "Automatic Speech Recognition", c: "Нутқни автоматик тарзда таниш." },
            { a: "Assembler", c: "Тушунчалари компьютер архитектурасини акс эттирадиган қуйи поғона дастурлаш тили. Ассемблер тили таркибига жумлалар, буйруқлар ва маълумотлар форматлари киради, улар муайян компьютер имкониятларига бир қийматли тарзда мос келадилар. Бошқача қилиб айтганда, ҳар бир операторга компьютернинг бирор буйруғи мос келади. Ассемблер тилидан машина тилига ўгиришни автоматлаштириш учун яратилган дастурлар ассемблерлар деб аталади. Ассемблернинг киришига Ассемблер тилида ёзилган дастлабки дастур киритилади. Ассемблер чиқишида машина буйруқларидан таркиб топган дастур берилади. Дисассемблер деганда, машина кодидан Ассемблер тилида ёзилган дастурга ўзгарувчи дастур назарда тутилади." },
            { a: "AST", b: "Atlantic Standard Time", c: "Стандарт Атлантика вақти. АҚШнинг Атлантика қирғоқларидаги соат пояси." },
            { a: "AT&T", c: "Ахборот тармоқларини ишлаб чиқувчи, ишлаб чиқарувчи ва уларни ишлатувчи компания. \"Америка телефони ва телеграфи\" AT&Т компанияси АҚШда 1885 йилда яратилган, биринчи телефон аппаратидан тортиб замонавий ақлий тармоққача бўлган йўлни босиб ўтган ва энг катта телекоммуникация корпорациясига айланган. AT&Т 300га яқин мамлакатни қамровчи ва 90 миллиондан ортиқ абонентга эга бўлган глобал ақлий тармоқ эгаси ва операторидир." },
            { a: "AT/MIDI", c: "Аввало клавиатуралар (PS/2гача), ҳозирги пайтда эса асосан мусиқа клавиатуралари ва синтезаторлари уланадиган портлар." },
            { a: "ATA", b: "Advanced Technology Attachment", c: "ATA интерфейси. Шахсий компьютерларда дискли тўпловчига уланиш ва ундан фойдаланиш учун ишлатиладиган интерфейслар ва протоколлар йиғмаси." },
            { a: "ATM Forum консорциуми", c: "Узатишнинг асинхрон усулини ишлатадиган тармоқлар учун халқаро стандартлар ишлаб чиқиш билан шуғулланадиган ташкилот. ATM Forum консорциуми 1991 йилда катта корпорациялар гуруҳи томонидан тузилган." },
            { a: "ATM асосий функционал профили", b: "Асинхрон усулда узатишнинг асосий функционал профили." },
            { a: "ATM коммутатор", c: "Узатишнинг асинхрон усули стандартларига мос равишда, маълумотлар блокларини тезкор қайта узатишни таъминлайдиган коммутатор. ATM коммутатори маълумотларни 1000 Мбит/ cекундли тезликкача узатадиган каналлар билан ишлайди. Бу локал тармоқлар, асосий компьютерлар ва юқори тезликдаги ишчи станцияларининг бир-бири билан алоқасини таъминлайди. ATM коммутаторларининг ўтказиш қобилияти ўнлаб Гбит/cекундга етиши мумкин. Бунга эришиш учун қайта узатиш фақат аппарат воситалар билан амалга оширилади. Коммутаторлар \"қайноқ алмаштириш\" имкониятларига эга, яъни улардаги модулларни коммутаторни тармоқдан ўчирмай алмаштириш мумкин." },
            { a: "Atom", c: "Янгиликлар ленталари, мақолалар анонслари ва ҳ.к. учун мўлжалланган XMLга асосланган формат. Спецификациянинг асосий қисми сайтни бошқаришни автоматлаштириш учун мўлжалланган ва HTTP устида ишлайдиган протоколдир. RSSдан кейин пайдо бўлиб, ушбу форматнинг камчиликларини бартараф этишга қаратилган." },
            { a: "ATX", b: "AT extension", c: "AT форматининг кенгайтмаси, шахсий компьютернинг бир неча йил олдин ишлаб чиқилган танаси тузилишининг ва мос равишда тегишли она платанинг формфактори. Пентиум II процессорларининг пайдо бўлиши билан оммавий сифатда фойдалана бошланди, чунки, бу процессорга она платалар фақат ATX форматида (жуда катта истисно билан) чиқарилади." },
            { a: "AUX", b: "AUXilliary", c: "Кўмакчи" },
            { a: "AVI", b: "Audio-Video Interleaving", c: "Аудио ва видеони галма-гал улаш учун AVI формати. Microsoft томонидан ишлаб чиқилган видеотасвирни ва у билан синхронлашган товушни сақлаш учун мўлжалланган файл формати." },
            { a: " AVR", b: "Automatic Voice Recognition", c: "Нутқни автоматик тарзда таниш." },
            { a: "AWK", b: "Aho, Weinberger, Kernighan", c: "AWK тили. UNIX муҳитида ишлатилади. Тилнинг номи унинг ижодкорлари фамилияларининг биринчи ҳарфларидан иборат." },
            { a: "B&W", b: "Black and White", c: "Оқ-қора монохром." },
            { a: "B1", b: "B1 security", c: "B1 хавфсизлик поғонаси. Тизимдан рухсат этилмаган фойдаланишдан муҳофазаланганлиги поғонаси учун NSA стандарти. DOD грифлар тизимининг ишлатилишини талаб қилади." },
            { a: "B2", b: "B2 security", c: "B2 хавфсизлик поғонаси. Тизимдан рухсат этилмаган фойдаланишдан муҳофазаланганлик поғонаси учун NSA стандарти. DOD грифлар тизими ишлатилишини, тестлаш имконини ва фойдаланиш поғонасини тасодифан пасайтириш мумкин эмаслигини талаб қилади." },
            { a: "B3", b: "B3 security", c: "B3 хавфсизлик поғонаси.\" Тизимдан рухсат этилмаган фойдаланишдан муҳофазаланганлик поғонаси учун NSA стандарти.Тизимнинг модели доирасида унинг зарурий хавфсизликни исботлаш мумкин бўлган математик моделини яратишни талаб қилади."},
            { a: "BACP", b: "Bandwidth Allocation Control Protocol", c: "Ўтказиш қобилиятини ажратишнинг бошқариш протоколи. ISDNда ишлатилади." },
            { a: "Banyan Systems", c: "Локал тармоқ уюшмаларининг дастурий таъминотини ишлаб чиқарувчи компания. Banyan Systems компанияси АҚШда 1983 йилда яратилган. Компания локал тармоқларни яратиш ва уларни бир-бири билан ҳудудий тармоқлар орқали боғлаш имконини берувчи блокли дастурий таъминотни таклиф этади." },
            { a: "Base64", c: "Base64 сўзма сўз маъноси - 64 асосли ҳолат ҳисоблаш тизими. Бу ерда 64 – 2 нинг энг юқори даражаси (26), ASCII босма белгилари ёрдамида тақдим қилиниши мумкин. Ушбу тизим электрон почтада бинар файлларни хат матнида тақдим қилиш учун кенг фойдаланилади (транспорт кодлаш). Ҳамма Base64 номи билан кенг тарқалган вариантлар A-Z, a-z ва 0-9 белгиларини ишлатади, 62 белгидан иборат, бошқа икки белги учун турли тизимда турли белгилар ишлатилади." },
            { a: "BASIC", b: "Beginner’s All-purpose Symbolic Instruction Code", c: "Бошловчиларнинг барча мақсадлар учун буйруқ коди\". 1960 йил ўрталарида Дартмут коллежида талабалар учун Жон Кемени(John Kemeney) ва Томас Куртц(Thomas Kurtz) томонидан ишлаб чиқилган.Тил содда ва қулай бўлиб, фойдаланувчиларнинг унча катта бўлмаган тизимлар билан мулоқот режимида ишлашида катта шуҳрат қозонди.Ўзининг соддалигига қарамай, BASIC кўпгина қўлланмаларни ишлаб чиқишда қўлланилади.BASIC тили тавсифининг ANSI стандарти мавжуд бўлса ҳам, BASICнинг кўпчилик версиялари кенгайтмаларни ўз ичига олади.Масалан, Microsoft компаниясининг Visual Basic маҳсулоти, BASIC тилининг стандартига қўшимча равишда, объектга йўналтирилган функциялар тўпламини ўз ичига олган.Ҳозирги кунда BASIC тилининг турли хиллари қўлланмаларнинг макротиллари сифатида қўшилмоқда.Масалан, Microsoft Word ва Excel фойдаланувчига шу қўлланмаларни созлаш ва автоматлаштириш учун дастурлар ёзиш имконини берадиган BASIC тилининг версиясини қўшадилар."},
            { a: "Bay Networks", c: "Ахборот тармоқларининг таркибий қисмларини ишлаб чиқарувчи компания. Bay Networks компанияси томонидан АҚШда ишлаб чиқариладиган асосий маҳсулотлар концентратор ва маршрутизаторлардир, жумладан, асинхрон узатиш усули ва Ethernet тармоқлари учун. Компания, шунингдек, турли протоколларни амалга оширувчи қурилмаларни, шу жумладан, ISDN ни ҳам ишлаб чиқаради." },
            { a: "BCC", b: "Blind Carbon Copy", c: "Кўр кўчирма нусха. Email сарлавҳасидаги кўчирма нусха юбориладиган манзил. BCC олувчисига хабарнинг барча манзил эгалари маълум бўлмайди." },
            { a: "BCD", b: "Binary Coded Decimal", c: "Иккилик-ўнлик саноқ тизимида ифодаланган сон. Сонларни бир байтда икки хонали ўнлик сонлар разряди билан кодлашга асосланган ифодалаш усули." },
            { a: "BD", b: "Blu-ray Disc", c: "Оптик маълумот ташувчи формат, рақамли маълумотларни хамда юқори аниқликдаги ва зичликдаги видеоларни ёзиш ва сақлаш учун фойдаланилади. Blu-ray стандарти BDA консорциуми билан биргаликда ишлаб чиқилган. Blu-ray (сўзма-сўз - «зангори нур») ўз номини ўқиш ва ёзиш учун фойдаланиладиган қисқа тўлқинли (405 нм) «зангори» (техник кўкиш-бинафша) лазердан олган. 2006 йил январида ўтган Consumer Electronics Show (CES) халқаро кўргазмасида намойиш қилинган. Blu-rayнинг тижорий тақдими 2006 йил баҳорида бошланган." },
            { a: "BDC", b: "Backup Domain Controller", c: "Доменнинг захиравий контроллери. Windows NT доменидаги дастлабки домен контроллерини (PDC) захиралаш ва ундан бир қисм юкланмани камайтириш учун ишлатиладиган компьютер. BDC маълумотлар базаларининг ҳисоб ёзувлари билан бирга, захира нусхасини, домен хавфсизлик сиёсати файлларининг захира нусхасини ва фойдаланиш скриптларини ўз ичига олади. Агар доменнинг бош назоратидан фойдаланиш мумкин бўлмаса, BDC доменни бошқариш бўйича асосий вазифаларни бажаради." },
            { a: "BDE", b: "Borland Database Engine", c: "Borland компаниясининг маълумотлар базасидан фойдаланиш технологияси. (API) технологияси Borlandтомонидан маълумотлар базасидан ўзаро алоқада фойдаланиш учун ишлаб чиқилган. BDEни яратиш лойиҳаси 1990 йилдан бошланган; даставвал бу технология ODAPI (Open Database API) номи билан тақдим қилинган." },
            { a: "BER", b: "Bit Error Rate", c: "Хато битлар частотаси. Маълумотларни узатишда хато битларнинг пайдо бўлиш жадаллиги." },
            { a: "BGA", b: "Ball Grid Array", c: "BGA танаси. Микросхеманинг туташмалар гуруҳининг зўлдирлар матрицаси шаклидаги тузилиши. Микросхема платага пайвандланади." },
            { a: "BGP", b: "Border Gateway Protocol", c: "BGP - чегара тармоқлараро протокол. NSFNET тармоғида EGP протоколи ишлатиш тажрибаси асосида яратилган ташқи маршрутлаш протоколи. RFCда 1163 ва 1164 тартиб рақамлари билан берилган." },
            { a: "Big Blue", c: "IBM (International Business Machines Corporation) компаниясининг жаргон номи. Кўк ранг (Blue) IBM компаниясининг корпоратив рангидир." },
            { a: "bin", b: "Бинар, яъни иккилик сўзининг қисқартмаси." },
            { a: "BIOS", b: "Basic Input/Output System", c: "Киритиш-чиқаришнинг асосий тизими. Шахсий компьютернинг она платадаги ДХҚ (доимий хотира қурилмаси) ёки ҚДДХҚ (қайта дастурланадиган доимий хотира қурилмаси) микросхемасига ёзилган дастур. BIOS компьютернинг операцион тизимдан келаётган кириш-чиқиш, қурилмаларни бошқариш сўровларига хизмат кўрсатади. Шунингдек, компьютер ёқилганда ускуналарни бошланғич текшириш (POST тартиботи), MBRни юклаш ва операцион тизимга бошқарувни узатиш ҳам BIOS вазифасига киради, BIOSда шахсий компьютернинг она плата конфигурациясининг асосий кўрсаткичларини қўлда созлаш учун интерактив нимдастури ҳам мавжуд." },
            { a: "BIP", b: "Bit Interleave Parity", c: "Битлар навбатланиши жуфтлиги. Жуфтлик битини ҳисоблаш ва таққослашга асосланган маълумотлар узатишнинг тўғрилигини назорат қилиш усули." },
            { a: "B-ISDN", b: "Broadband Integrated Services Digital Network", c: "қ: хизматлари бирлашган кенг полосали рақамли тармоқ" },
            { a: "BIST", b: "Built-In Self-Test", c: "Ичига ўрнатилган ўз-ўзини тестлаш. Ўз-ўзини тестлаш учун маҳсулот ичига ўрнатилган аппарат ва/ёки дастурий воситалар." },
            { a: "BitTorrent", c: "Интернет орқали файлларни ўзаро алмашиш учун пиринг (P2P) тармоқ протоколи (инг. \"битлар оқими\"). Файллар бўлакларга ажратилиб узатилади, ва ҳар бир torrent мижози ушбу бўлакларни юклаб олаётган пайтнинг ўзида уларни бошқа мижозларга узатади. Бу юкламани ва ҳар бир мижозга боғлиқликни камайтиради ҳамда маълумотларнинг ортиқчалигини таъминлайди." },
            { a: "black hat", c: "Компьютер ёки тизимни бузиб кирган ёки компьютер вирусини ишлатган хакерга нисбатан айтиладиган ибора." },
            { a: "BLOB", b: "Binary Large Object", c: "Катта иккилик объекти. Айрим дастурлаш тиллари ва МББТдаги ихтиёрий иккилик саноқ тизимида берилган ахборотни сақлаш учун мўлжалланган маълумотлар тури." },
            { a: "BLOG weB LOG Тармоқда ўқилиши мумкин бўлган шахсий кундалик. Блогни олиб бориш блогинг деб, унинг эгаси эса, блогер деб аталади." },
            { a: "Bluetooth", c: "Кичик фаолият доирасига эга бўлган (частоталар оралиғи 2,4 ГГц) симсиз алоқа технологияси. Тармоқ қурилмалари орасидаги ўзаро ишлашни ва уларнинг Интернетга уланишини осонлаштиради. У, шунингдек, Интернет қурилмалари ва бошқа компьютерлар орасида маълумотлар синхронлаштирилишини осонлаштиради. Bluetooth катта маълумотлар оқимларини узатишга мўлжалланмаганлиги учун локал ва глобал тармоқ технологияларининг ўрнини боса олмайди." },
            { a: "BMP", b: "Bit MaP", c: "Бит картаси, BMP формати. Растрли график тасвирларни ифодалаш учун мўлжалланган оддий формат." },
            { a: "BNC", c: "Bayonet Nut Connector / Bayonet Neil-Concelman connector", c: "Bayonet улагичи, BNC-улагич. Коаксиал кабель учун улаш уяси." },
            { a: "BNF", b: "Backus-Naur Form / Backus Normal Form", c: "Бэкус-Наурнинг нормал шакли, BNF. Тилнинг синтаксисини расмий аниқлаш учун матнли кўрсатмалар." },
            { a: "BOND", b: "Band width ON Demand", c: "Талабга кўра ўтказиш қобилиятини тақдим қилиш." },
            { a: "BOOTP", b: "BOOTstrap Protocol", c: "BOOTP протоколи, бошланғич юклаш протоколи. Дисксиз ишчи станцияларини сервердан бошланғич конфигурациялаш ва юклаш учун мўлжалланган тармоқ протоколи. BOOTP протоколи RARP учун муқобил сифатида ишлаб чиқилган ва одатда TFTP билан биргаликда ишлатилади. У амалга оширишда соддароқ ва RARP сингари канал поғонасидаги фреймларни эмас, балки UDP транспорт протоколини ишлатади. BOOTP протоколи RFC 951, 1542 ва 1533 ларда тавсифланган." },
            { a: "Borland International", b: "Borland International", c: "корпорацияси Дастурий таъминот ва маълумотлар базаларини бошқариш тизимларини ишлаб чиқиш билан шуғулланувчи компания. Borland 1983 йилда яратилган бўлиб, Калифорнияда (АҚШда) жойлашган. Компаниянинг асосий ишланмалари қаторига қуйидагилар киради: - Delphi – Windows қўлланмаларини яратиш муҳити, - Borland С++ – дастурлаш тили, - IntraBuilder – JavaScript тили учун кўриб ишлайдиган восита, - CodeWright – дастурлар муҳаррири, - Kylix – Linux учун электрон бизнес ечими." },
            { a: "BOT", b: "Back On Topic", c: "Мавзуга қайтиб." },
            { a: "BPE", b: "Back Propagation of Error", c: "Хатонинг тескари тарқалиши. Сунъий нейрон тармоғини ўқитиш услуби." },
            { a: "BPR", b: "Business Process Reengineering", c: "Бизнес-жараён реинжиниринги (қайта қурилиши). Корхонада унинг муҳим фаолият кўрсаткичларини сезиларли яхшилаш мақсадида иш тартиботларини тўла рўйхатдан ўтказиш, таҳлил қилиш ва қайта ташкиллаштириш. Одатда, малакали консалтинг фирмалари томонидан умумий қабул қилинган ва/ёки фирма услубиятларини қўллаб, корхонада янги ахборот технологияларини татбиқ қилиш билан амалга оширилади." },
            { a: "BPU", b: "Branch Prediction Unit", c: "Тармоқланишни башоратловчи қурилма. Микропроцессорнинг архитектура элементи." },
            { a: " BRI", b: "Basic Rate Interface", c: "Асосий поғона интерфейси, BRI интерфейси. Икки маълумотлар узатиш каналининг (Bканал) ҳар бирининг тезлиги 64 Кбит/секунд ва битта бошқарув канали (D-канал) тезлиги 16 Кбит/секунд бўлган ISDN линияси. Ахборотни 128 Кбит/секунд тезлик билан узатиш имконини беради." },
            { a: " BS", b: "BackSpace", c: "Белгига қайтиш (ASCIIнинг бошқарувчи коди)." },
            { a: "BSA", b: "Business Software Alliance", c: "Тижорий дастурий таъминот ишлаб чиқарувчилари альянси. Microsoft томонидан дастурий таъминотни ноқонуний тарқатишга (қароқчиликка) қарши курашиш учун тузилган ташкилот." },
            { a: "BSD License", c: "BSD лицензияси, Беркли университетининг дастурий лицензияси. Бу лицензион келишув, биринчи бор UNIX каби BSD операцион тизимларни тарқатиш учун қўлланган. Кейинчалик келишувнинг илк версияси бир неча бор ўзгартирилди ва бу ўзгаришлар BSD типидаги лицензиялар деб аталди. Ҳозирги пайтда BSD типидаги лицензиялар эркин ДТ учун энг машҳур лицензиялар ҳисобланади ва улар бошқа дастурлар билан ҳам (BSD илк бор яралган UNIX версиялари) қўлланилади. BSDнинг илк дистрибутив ҳуқуқи расмий равишда \"Калифорния Университети васийлари\"га (ингл. Regents of the University of California) - Калифорния университети бошқарув органларига тегишли. Сабаби, BSD Калифорния университетининг Беркли кампусида ишлаб чиқилган. Бу ҳуқуқларнинг акс эттирилиши BSDнинг замонавий версияларида (NetBSD, FreeBSD, OpenBSD, DragonFly BSD) ҳам сақланиб қолган. Бошқа кенг тарқалган эркин ДТ лицензиялар билан солиштирилганда (масалан GNU General Public License) BSD лицензияси фойдаланувчига камроқ чегаралар қўяди. Шунинг учун бу лицензияни ишлатиш дастурни умумий фойдаланишга қўйган билан тенг" },
            { a: "BSDI", b: "BSDI корпорацияси", c: "Berkeley Software Design, Inc. сўзларининг қисқартмаси. Тижорат бўйича UNIX операцион тизимининг BSD (Berkeley) версиясига асосланган тармоқ (жумладан, Интернет тармоғи учун) дастурий таъминотини етказиб бериш билан шуғулланади." },
            { a: "BSI", c: "British Standards Institute", c: "Британия стандартлар институти." },
            { a: "BSOD", b: "Blue Screen Of Death", c: "Кўк ўлим экрани. Windows NT операцион тизимининг муҳофаза нолли ҳалқасида (операцион тизим ўзагида ёки драйверда) хотира муҳофазасининг бузилиши (GPF) хатосига бўлган жавоб ҳаракати. У тизимнинг тўхташига ва қайта юкланишига олиб келади." },
            { a: "BTB", b: "Branch Target Buffer", c: "Тармоқланишнинг мақсадли буфери. Микропроцессорнинг ички блоки." },
            { a: "Bus Master", c: "Шина эгаси. Қурилманинг хоҳлаган шинада (жумладан PCIда) мумкин бўлган иш режими. Бундай режимда ишлаш учун қурилма шина арбитрига шинани бошқаришни олиш ҳақидаги талабини ифодаловчи буйруқ беради. Арбитр, ушбу шинада арбитражнинг устуворлиги ва/ёки кетма-кетлигига мувофиқ, ҳужжатларда буйруқдан кейин ўтиши лозим бўлган белгиланган вақтдан кейин сўраётган қурилмага шина бошқаришни узатади. Барча керакли амалларни бажариб бўлгандан кейин қурилма арбитрга шина бўшатилиши ҳақида хабар беради." },
            { a: "C", c: "Юқори поғонадаги дастурлаш тили. Bell Labs компаниясида Деннис Ритчи томонидан 1970 йил ўрталарида ишлаб чиқилган. C тилидаги биринчи аҳамиятли дастур UNIX операцион тизими бўлди, бундан кейин бир неча йил давомида C тили UNIX билан чамбарчас боғланди. Аммо, ҳозирга келиб, C тили UNIXдан мустақилдир. Соддалик, самарадорлик ва бошқа операцион тизимларга енгил кўчириш имкони тилни кенг тарқалган тиллардан бирига айлантирди. C тилида замонавий юқори поғонадаги тилларнинг аломатлари ва Ассемблер тили билан уюшадиган компьютернинг техника воситаларини манзиллаш имкони муваффақиятли қўшилиб кетган. C тили касбий дастурчиларни жалб қиладиган қулай синтаксисга эга. C тили ISO томонидан стандарт сифатида тасдиқланган. Объектга йўналтирилган архитектурадан фойдаланилиши кенгайтирилган C++ тили пайдо бўлишига олиб келди." },
            { a: "C#", c: "Инглиз тилида \"C sharp\" деб талаффуз қилинади. Microsoft .NET платформаси учун объектга йўналтирилган дастурлаш тили. C ва C++ тилларининг чатишмаси бўлади. Microsoft компанияси томонидан Sun компаниясининг Java тилига рақобатдош сифатида ишлаб чиқилган. Microsoft мутахассисларининг айтишларича, C# ўзида C++ тилининг қувватини ва Visual Basic муҳити соддалигини мужассамлантирган. C# веб-қўлланмалар ишлаш тезлигини ва самарадорлигини оширишга йўналтирилган. Тил қатъиян статик намуналашган бўлиб, қатъий объектга йўналтирилган дастурлаш тили эмас (объектлар турларидан ташқари маълумотлар турларига эга). У полиморфизм, операторларнинг ортиқча юкланиши, кўп оқимли ҳисоблар, вакиллик функциялари, ҳодисалар, хоссалар, истиснолар ва XML форматидаги шарҳларни қўллайди ва чиқиндиларни автоматик тарзда йиғади. C# илк бор 2000 йилда чиққан." },
            { a: "C++", c: "Bell Labs компаниясида Бьёрн Страуструп (Bjarne Stroustrup) томонидан ишлаб чиқилган юқори поғонадаги дастурлаш тили. С++ тили С тилини объектга йўналтирилган функциялар билан тўлдиради. С++ тили Windows ва Macintosh муҳитида ишлайдиган график қўлланмаларни яратиш учун мўлжалланган энг оммавий тиллардан бири ҳисобланади." },
            { a: "C1", c: "C1 security С1 хавфсизлик поғонаси. Тизимдан рухсатсиз фойдаланишдан муҳофазаланганлик поғонаси учун NSA стандарти. Тизимдан фойдаланиш тартиботларига риоя қилишни талаб қилади, гуруҳий идентификаторларни ишлатишга йўл беради." },
            { a: "C2", c: "C2 security С2 хавфсизлик поғонаси. Тизимдан рухсатсиз фойдаланишдан муҳофазаланганлик поғонаси учун NSA стандарти. Фойдаланувчиларни мувофиқлаш учун фақат шахсий идентификаторларни ишлатишни ҳамда аудит воситалари бўлишини талаб қилади." },
            { a: "C2B", b: "Customer To Business", c: "Истеъмолчи бизнес учун – электрон тижорат тури, унда истеъмолчига компаниялар таклиф қилаётган турли товарлар ва хизматларга мустақил равишда нарх қўйиш имкони берилади. Шундай қилиб, талаб шаклланади, лекин бу сўралган нархда сотув юз беришини англатмайди. Сотувчи жорий сўровлар натижаларига кўра, якуний қарор қабул қилади." },
            { a: "C2C", b: "Customer To Customer", c: "Истеъмолчи истеъмолчи учун - электрон тижорат тури, унинг моҳияти истеъмолчилар орасида товарлар ва хизматлар сотилишида. Бу ҳолда сайт сотувчи ва харидор орасидаги воситачи ўрнида ҳаракат қилади." },
            { a: "CA", b: "Computer Associates", c: "Дастурий таъминот ишлаб чиқарувчи АҚШ компанияси." },
            { a: "Cabletron Systems", c: "Ахборот тармоқлари учун жиҳозларни етказиб берувчи компания. АҚШда яратилган Cabletron Systems компанияси тармоқни бошқариш платформасини яратиш учун мўлжалланган дастурлар мажмуини ишлаб чиққан. Компания тафаккурга эга концентраторларнинг етакчи етказиб берувчисидир." },
            { a: "CAD", b: "Computer-Aided Design", c: "қ: компьютерлашган лойиҳалаш" },
            { a: "CADDIF", b: "CAD Data Interchange Format", c: "CADDIF формати. CAD-тизимлари орасидаги маълумотлар алмашиш формати." },
            { a: "CAI", b: "Computer-Aided Instruction", c: "Компьютер ёрдамида ўқитиш. Махсус ўқитиш дастурини ишлатиб ўқитиш." },
            { a: "CALS", b: "Computer-Aided Logistics System", c: "қ: компьютерлашган логистик тизим" },
            { a: "CAM", b: "Computer-Aided Manufacturing", c: "қ: компьютерлашган ишлаб чиқариш" },
            { a: "Canon", c: "Турли хил компьютерлаштирилган қурилмаларни яратиш ва ишлаб чиқариш билан шуғулланувчи компания. Canon компанияси ўзининг лазерли ва пурковчи принтерлари туфайли кенг шуҳрат қозонган." },
            { a: "careware", c: "ингл. care - кайғурмок ва software - дастурий таъминот. Шартли-текин shareware дастурий таъминотининг тури. Ушбу дастурий таъминотининг муаллифи тўлов хайрияга ишлатилишини талаб қилади. Синоними - charityware." },
            { a: "CAS", b: "Computer-Aided System қ: компьютерлашган тизим" },
            { a: "CASE", b: "Computer-Aided Software Engineering", c: "қ: компьютерлашган дастурий таъминотни ишлаб чиқариш." },
            { a: "CAST", b: "Computer-Aided Software Testing", c: "Дастурий таъминотни автоматлаштирилган тестлаш." },
            { a: "CATV", b: "Cable TV", c: "Кабель телевидениеси." },
            { a: "CAV", b: "Constant Angular Velocity", c: "Ўзгармас бурчак тезлиги." },
        ],
    }),
    computed: {
        isAuth() {
            return this.$store.getters['auth/isAuth']
        }
    },
    methods: {
        speachVoice() {
            if (this.title !== '') {
                const msg = new SpeechSynthesisUtterance()
                msg.text = this.title
                // console.log('speech', this.title);
                window.speechSynthesis.speak(msg)
            }
        },
        admin() {
            this.$router.push('/admin')
        },
        login() {
            this.$router.push('/login')
        },
        async submit () {
            this.validation.word = ''
            this.loading = true
            // this.figures = this.word.toLowerCase().split('')
            const searched = this.words.find(c => c.a.toLocaleLowerCase().includes(this.word.toLocaleLowerCase()))

            if(searched){
                this.title = this.word
                this.lemma = searched.a || this.title
                this.razmetka = searched.b || this.title
                this.izoh = searched.c
            } else {
                this.validation.word = 'Ushbu so\'z topilmadi!'
            }
            
            this.loading = false
        }
    }
}
</script>
  
<style>
@import url('/assets/css.css');

.qisqa {
    margin-left: 0px;
    margin-right: 0px;
}

.card13 {
    /* width: 234px; */
    /* height: 114px; */
    font-size: 14px;
    border-radius: 10px;
    background-color: #39959a50;
    color: #18c8e3;
    box-shadow: 0px 4px 25px 0px rgba(30, 140, 195, 0.362);
    /* transition: all .3s ease-in-out; */
    text-align: center;
}

html,
body {
    background: url('/assets/fon.jpg') repeat;
}

.background-paper {
    background-color: rgba(244, 244, 244, 0.5);
    border-left: 1px solid #b2b2b2;
    border-right: 1px solid #b2b2b2;
}

.blue-text {
    color: #6451a8;
}

.buttonWidth {
    width: 200px;
}

.inputWidth100 {
    min-width: calc(100% - 210px);
}

.vh100 {
    min-height: calc(100vh - 235px);
}

.logo-left {
    background: url('/assets/gerb.png') center center no-repeat;
    background-size: 70%;
    height: 100px;
}

.logo-right {
    background: url('/assets/reg.png') center center no-repeat;
    background-size: 100% 100%;
}

.text-red {
    color: rgb(37, 35, 145);
    font-size: 220%;
}

.border-style {
    border-top-left-radius: 24px;
    border-top-right-radius: 24px;
}

.nav-link {
    color: rgba(255, 255, 255, 0.9) !important;
}

@media only screen and (max-width: 1100px) {
    .blockshow {
        display: none !important;
    }

    .border-style {
        border-top-left-radius: 0px;
        border-top-right-radius: 0px;
    }

    .buttonWidth {
        width: 80px
    }

    .inputWidth100 {
        min-width: calc(100% - 90px);
    }

    .vh100 {
        min-height: calc(100vh - 255px);
    }
}

@media only screen and (max-width: 1300px) {
    h5 {
        font-size: 14pt !important;
    }
}

.yangihover {
    transition: all 0.4s linear;
}

.yangihover:hover {
    transform: scale(1.05);
}

.yangihover1 {
    transition: all 0.3s linear;
}

.yangihover1:hover {
    transform: scale(1.05);
}
</style>
  